// Експортуємо всі функції та утиліти з модуля field-helpers
// Містить допоміжні функції для роботи з ігровим полем, наприклад, ініціалізацію поля та розміщення кораблів
export * from './field-helpers';

// Експортуємо всі функції та утиліти з модуля cell-helpers
// Містить допоміжні функції для роботи зі станами клітинок, наприклад, перевірку зайнятості або знищення корабля
export * from './cell-helpers';

// Експортуємо функцію getAiShot з модуля get-ai-shot
// Відповідає за логіку пострілів штучного інтелекту, визначаючи клітинку для атаки
export * from './get-ai-shot';

// Експортуємо функцію getShipCells з модуля get-ship-cells
// Дозволяє знайти всі клітинки, що належать до корабля, за заданою початковою клітинкою
export * from './get-ship-cells';

// Експортуємо всі функції та утиліти з модуля mark-missed-adjacent-cells
// Містить функції для позначення сусідніх клітинок як промах (missed) після знищення корабля
export * from './mark-missed-adjacent-cells';